espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
/*
 * BLEDevice.cpp
 *
 *  Created on: Mar 16, 2017
 *      Author: kolban
 *
 *  Modified on: Feb 18, 2025
 *      Author: lucasssvaz (based on kolban's and h2zero's work)
 *      Description: Added support for NimBLE
 */

#include "soc/soc_caps.h"
#include "sdkconfig.h"
#if defined(SOC_BLE_SUPPORTED) || defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
#if defined(CONFIG_BLUEDROID_ENABLED) || defined(CONFIG_NIMBLE_ENABLED)

/***************************************************************************
 *                           Common includes                               *
 ***************************************************************************/

#include <freertos/FreeRTOS.h>
#include <freertos/event_groups.h>
#include <freertos/task.h>
#include <esp_err.h>
#include <nvs_flash.h>

#if SOC_BLE_SUPPORTED
#include <esp_bt.h>
#endif

#include <esp_err.h>
#include <map>
#include <sstream>
#include <iomanip>

#include "BLEDevice.h"
#include "BLEClient.h"
#include "BLEUtils.h"
#include "GeneralUtils.h"
#include "BLESecurity.h"
#include "base64.h"

#if defined(ARDUINO_ARCH_ESP32)
#include "esp32-hal-bt.h"
#include "esp32-hal-bt-mem.h"
#endif

#include "esp32-hal-log.h"

/***************************************************************************
 *                           Bluedroid includes                            *
 ***************************************************************************/

#if defined(CONFIG_BLUEDROID_ENABLED)
#include <esp_bt_device.h>
#include <esp_bt_main.h>
#include <esp_gap_ble_api.h>
#include <esp_gatts_api.h>
#include <esp_gattc_api.h>
#include <esp_gatt_common_api.h>
#endif

/***************************************************************************
 *                           NimBLE includes                               *
 ***************************************************************************/

#if defined(CONFIG_NIMBLE_ENABLED)
#ifdef CONFIG_BT_NIMBLE_LEGACY_VHCI_ENABLE
#include <esp_nimble_hci.h>
#endif
#include <nimble/nimble_port.h>
#include <nimble/nimble_port_freertos.h>
#include <host/ble_hs.h>
#include <host/ble_hs_pvcy.h>
#include <host/ble_gap.h>
#include "host/ble_hs_pvcy.h"
#include "host/util/util.h"
#include "services/gap/ble_svc_gap.h"
#include "services/gatt/ble_svc_gatt.h"
#endif

#if defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
#include "esp32-hal-hosted.h"
#endif

/***************************************************************************
 *                            Common properties                            *
 ***************************************************************************/

/**
 * Singletons for the BLEDevice.
 */
BLEServer *BLEDevice::m_pServer = nullptr;
BLEScan *BLEDevice::m_pScan = nullptr;
BLEClient *BLEDevice::m_pClient = nullptr;
static bool initialized = false;
BLESecurityCallbacks *BLEDevice::m_securityCallbacks = nullptr;
uint16_t BLEDevice::m_localMTU = 23;  // not sure if this variable is useful
BLEAdvertising *BLEDevice::m_bleAdvertising = nullptr;
uint16_t BLEDevice::m_appId = 0;
std::map<uint16_t, conn_status_t> BLEDevice::m_connectedClientsMap;
gap_event_handler BLEDevice::m_customGapHandler = nullptr;

/***************************************************************************
 *                           Bluedroid properties                          *
 ***************************************************************************/

#if defined(CONFIG_BLUEDROID_ENABLED)
gattc_event_handler BLEDevice::m_customGattcHandler = nullptr;
gatts_event_handler BLEDevice::m_customGattsHandler = nullptr;
#endif

/***************************************************************************
 *                            NimBLE properties                            *
 ***************************************************************************/

#if defined(CONFIG_NIMBLE_ENABLED)
ble_gap_event_listener BLEDevice::m_listener;
BLEDeviceCallbacks BLEDevice::defaultDeviceCallbacks{};
BLEDeviceCallbacks *BLEDevice::m_pDeviceCallbacks = &defaultDeviceCallbacks;
uint8_t BLEDevice::m_ownAddrType = BLE_OWN_ADDR_PUBLIC;
bool BLEDevice::m_synced = false;
String BLEDevice::m_deviceName;
#endif

/***************************************************************************
 *                           Common functions                             *
 ***************************************************************************/

/**
 * @brief Create a new instance of a client.
 * @return A new instance of the client.
 */
BLEClient *BLEDevice::createClient() {
  log_v(">> createClient");
#if !defined(CONFIG_GATTC_ENABLE) && !defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
  log_e("BLE Client not enabled. Check CONFIG_GATTC_ENABLE for BlueDroid or CONFIG_BT_NIMBLE_ROLE_CENTRAL for NimBLE");
  abort();
#endif  // CONFIG_GATTC_ENABLE

  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return nullptr;
  }

#ifdef CONFIG_NIMBLE_ENABLED
  if (m_connectedClientsMap.size() >= CONFIG_BT_NIMBLE_MAX_CONNECTIONS) {
    log_e("Unable to create client. Max connections reached. Cur=%d Max=%d", m_connectedClientsMap.size(), CONFIG_BT_NIMBLE_MAX_CONNECTIONS);
    m_pClient = nullptr;
  } else
#endif
  {
    m_pClient = new BLEClient();
  }
  log_v("<< createClient");
  return m_pClient;
}  // createClient

/**
 * @brief Create a new instance of a server.
 * @return A new instance of the server.
 */
BLEServer *BLEDevice::createServer() {
  log_v(">> createServer");
#if !defined(CONFIG_GATTS_ENABLE) && !defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
  log_e("BLE Server not enabled. Check CONFIG_GATTS_ENABLE for BlueDroid or CONFIG_BT_NIMBLE_ROLE_PERIPHERAL for NimBLE");
  abort();
#endif  // CONFIG_GATTS_ENABLE

  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return nullptr;
  }

  if (m_pServer == nullptr) {
    m_pServer = new BLEServer();
    m_pServer->createApp(m_appId++);
#if defined(CONFIG_NIMBLE_ENABLED)
    ble_gatts_reset();
    ble_svc_gap_init();
    ble_svc_gatt_init();
#endif
  }
  log_v("<< createServer");
  return m_pServer;
}  // createServer

/**
 * @brief Get the BLE device address.
 * @return The BLE device address.
 */
BLEAddress BLEDevice::getAddress() {
  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return BLEAddress();
  }
#if defined(CONFIG_BLUEDROID_ENABLED)
  const uint8_t *bdAddr = esp_bt_dev_get_address();
  esp_bd_addr_t addr;
  memcpy(addr, bdAddr, sizeof(addr));
#endif

