espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
#if defined(CONFIG_NIMBLE_ENABLED)
  ble_addr_t addr;
  int ret = ble_hs_id_copy_addr(m_ownAddrType, addr.val, NULL);
  if (ret != 0) {
    log_e("No BLE address found. rc=%d", ret);
    return BLEAddress();
  }
#endif
  return BLEAddress(addr);
}  // getAddress

/**
 * @brief Retrieve the Scan object that we use for scanning.
 * @return The scanning object reference.  This is a singleton object.  The caller should not
 * try and release/delete it.
 */
BLEScan *BLEDevice::getScan() {
  //log_v(">> getScan");
  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return nullptr;
  }
  if (m_pScan == nullptr) {
    m_pScan = new BLEScan();
    //log_d(" - creating a new scan object");
  }
  //log_v("<< getScan: Returning object at 0x%x", (uint32_t)m_pScan);
  return m_pScan;
}  // getScan

/**
 * @brief Retrieve the server object
 * @return The server object
 */
BLEServer *BLEDevice::getServer() {
  return m_pServer;
}  // getServer

/**
 * @brief Get the value of a characteristic of a service on a remote device.
 * @param [in] bdAddress
 * @param [in] serviceUUID
 * @param [in] characteristicUUID
 */
String BLEDevice::getValue(BLEAddress bdAddress, BLEUUID serviceUUID, BLEUUID characteristicUUID) {
  log_v(
    ">> getValue: bdAddress: %s, serviceUUID: %s, characteristicUUID: %s", bdAddress.toString().c_str(), serviceUUID.toString().c_str(),
    characteristicUUID.toString().c_str()
  );
  BLEClient *pClient = createClient();
  if (pClient == nullptr) {
    log_e("Failed to create BLE client");
    return String();
  }
  pClient->connect(bdAddress);
  String ret = pClient->getValue(serviceUUID, characteristicUUID);
  pClient->disconnect();
  log_v("<< getValue");
  return ret;
}  // getValue

/**
 * @brief Initialize the %BLE environment.
 * @param deviceName The device name of the device.
 * @return true if initialization was successful, false otherwise.
 */
bool BLEDevice::init(String deviceName) {
  if (initialized) {
    return true;  // Already initialized
  }

  log_i("Initializing BLE stack: %s", getBLEStackString().c_str());

  esp_err_t errRc = ESP_OK;
#if defined(CONFIG_BLUEDROID_ENABLED)
#if defined(ARDUINO_ARCH_ESP32)
  if (!btStart()) {
    errRc = ESP_FAIL;
    return false;
  }
#else
  btStarted();
  errRc = nvs_flash_init();
  if (errRc == ESP_ERR_NVS_NO_FREE_PAGES || errRc == ESP_ERR_NVS_NEW_VERSION_FOUND) {
    errRc = nvs_flash_erase();
    if (errRc == ESP_OK) {
      errRc = nvs_flash_init();
    }
  }

  if (errRc != ESP_OK) {
    log_e("nvs_flash_init: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }

#ifndef CONFIG_BT_CLASSIC_ENABLED
  esp_bt_controller_mem_release(ESP_BT_MODE_CLASSIC_BT);
#endif

  esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
  errRc = esp_bt_controller_init(&bt_cfg);
  if (errRc != ESP_OK) {
    log_e("esp_bt_controller_init: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }

#ifndef CONFIG_BT_CLASSIC_ENABLED
  errRc = esp_bt_controller_enable(ESP_BT_MODE_BLE);
  if (errRc != ESP_OK) {
    log_e("esp_bt_controller_enable: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }
#else
  errRc = esp_bt_controller_enable(ESP_BT_MODE_BTDM);
  if (errRc != ESP_OK) {
    log_e("esp_bt_controller_enable: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }
#endif
#endif  // !ARDUINO_ARCH_ESP32

  esp_bluedroid_status_t bt_state = esp_bluedroid_get_status();
  if (bt_state == ESP_BLUEDROID_STATUS_UNINITIALIZED) {
    errRc = esp_bluedroid_init();
    if (errRc != ESP_OK) {
      log_e("esp_bluedroid_init: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return false;
    }
  }

  if (bt_state != ESP_BLUEDROID_STATUS_ENABLED) {
    errRc = esp_bluedroid_enable();
    if (errRc != ESP_OK) {
      log_e("esp_bluedroid_enable: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      return false;
    }
  }

  errRc = esp_ble_gap_register_callback(BLEDevice::gapEventHandler);
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_register_callback: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }

#ifdef CONFIG_GATTC_ENABLE  // Check that BLE client is configured in make menuconfig
  errRc = esp_ble_gattc_register_callback(BLEDevice::gattClientEventHandler);
  if (errRc != ESP_OK) {
    log_e("esp_ble_gattc_register_callback: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }
#endif  // CONFIG_GATTC_ENABLE

#ifdef CONFIG_GATTS_ENABLE  // Check that BLE server is configured in make menuconfig
  errRc = esp_ble_gatts_register_callback(BLEDevice::gattServerEventHandler);
  if (errRc != ESP_OK) {
    log_e("esp_ble_gatts_register_callback: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }
#endif  // CONFIG_GATTS_ENABLE

  errRc = ::esp_ble_gap_set_device_name(deviceName.c_str());
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_set_device_name: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  };

#ifdef CONFIG_BLE_SMP_ENABLE  // Check that BLE SMP (security) is configured in make menuconfig
  esp_ble_io_cap_t iocap = ESP_IO_CAP_NONE;
  errRc = ::esp_ble_gap_set_security_param(ESP_BLE_SM_IOCAP_MODE, &iocap, sizeof(uint8_t));
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_set_security_param: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  };
#endif  // CONFIG_BLE_SMP_ENABLE
#endif  // CONFIG_BLUEDROID_ENABLED

#if defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
  // Initialize esp-hosted transport for BLE HCI when explicitly enabled
  if (!hostedInitBLE()) {
    log_e("Failed to initialize ESP-Hosted for BLE");
    return false;
  }

  // Hosted HCI driver will be initialized automatically by NimBLE transport layer
#endif

#if defined(CONFIG_NIMBLE_ENABLED)
  errRc = nimble_port_init();
  if (errRc != ESP_OK) {
    log_e("nimble_port_init: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }

  // Global struct ble_hs_cfg from nimble/host/ble_hs.h needs to be initialized
  ble_hs_cfg.reset_cb = BLEDevice::onReset;
  ble_hs_cfg.sync_cb = BLEDevice::onSync;
  ble_hs_cfg.store_status_cb = [](struct ble_store_status_event *event, void *arg) {
    return m_pDeviceCallbacks->onStoreStatus(event, arg);
  };
  ble_hs_cfg.sm_io_cap = BLE_HS_IO_NO_INPUT_OUTPUT;
  ble_hs_cfg.sm_bonding = 0;
  ble_hs_cfg.sm_mitm = 0;
  ble_hs_cfg.sm_sc = 1;
  ble_hs_cfg.sm_our_key_dist = BLE_SM_PAIR_KEY_DIST_ENC;
  ble_hs_cfg.sm_their_key_dist = BLE_SM_PAIR_KEY_DIST_ENC;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
  ble_hs_cfg.sm_our_key_dist |= BLE_SM_PAIR_KEY_DIST_ID;
  ble_hs_cfg.sm_their_key_dist |= BLE_SM_PAIR_KEY_DIST_ID;
#endif

