espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
/*
 * @brief Get a peer device's IRK in reverse hex format.
 * @param [in] peerAddress The address of the bonded peer device.
 * @return String in reverse hex format (uppercase) or empty string on failure.
 */
String BLEDevice::getPeerIRKReverse(BLEAddress peerAddress) {
  uint8_t irk[16];
  if (!getPeerIRK(peerAddress, irk)) {
    return String();
  }

  String result = "";
  for (int i = 15; i >= 0; i--) {
    if (irk[i] < 0x10) {
      result += "0";
    }
    result += String(irk[i], HEX);
  }
  result.toUpperCase();
  return result;
}

BLEAdvertising *BLEDevice::getAdvertising() {
  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return nullptr;
  }
  if (m_bleAdvertising == nullptr) {
    m_bleAdvertising = new BLEAdvertising();
    log_i("create advertising");
  }
  log_d("get advertising");
  return m_bleAdvertising;
}

void BLEDevice::startAdvertising() {
  log_v(">> startAdvertising");
  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return;
  }
  getAdvertising()->start();
  log_v("<< startAdvertising");
}  // startAdvertising

void BLEDevice::stopAdvertising() {
  log_v(">> stopAdvertising");
  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return;
  }
  getAdvertising()->stop();
  log_v("<< stopAdvertising");
}  // stopAdvertising

/* multi connect support */
/* requires a little more work */
std::map<uint16_t, conn_status_t> BLEDevice::getPeerDevices(bool _client) {
  return m_connectedClientsMap;
}

BLEClient *BLEDevice::getClientByID(uint16_t conn_id) {
  return BLEDevice::getClientByGattIf(conn_id);
}

BLEClient *BLEDevice::getClientByGattIf(uint16_t conn_id) {
  return (BLEClient *)m_connectedClientsMap.find(conn_id)->second.peer_device;
}

BLEClient *BLEDevice::getClientByAddress(BLEAddress address) {
  for (auto &it : m_connectedClientsMap) {
    if (((BLEClient *)it.second.peer_device)->getPeerAddress() == address) {
      return (BLEClient *)it.second.peer_device;
    }
  }
  return nullptr;
}

void BLEDevice::updatePeerDevice(void *peer, bool _client, uint16_t conn_id) {
  log_d("update conn_id: %d, GATT role: %s", conn_id, _client ? "client" : "server");
  std::map<uint16_t, conn_status_t>::iterator it = m_connectedClientsMap.find(ESP_GATT_IF_NONE);
  if (it != m_connectedClientsMap.end()) {
    std::swap(m_connectedClientsMap[conn_id], it->second);
    m_connectedClientsMap.erase(it);
  } else {
    it = m_connectedClientsMap.find(conn_id);
    if (it != m_connectedClientsMap.end()) {
      conn_status_t _st = it->second;
      _st.peer_device = peer;
      std::swap(m_connectedClientsMap[conn_id], _st);
    }
  }
}

void BLEDevice::addPeerDevice(void *peer, bool _client, uint16_t conn_id) {
  log_i("add conn_id: %d, GATT role: %s", conn_id, _client ? "client" : "server");
  conn_status_t status = {.peer_device = peer, .connected = true, .mtu = 23};

  m_connectedClientsMap.insert(std::pair<uint16_t, conn_status_t>(conn_id, status));
}

//there may have some situation that invoking this function simultaneously, that will cause CORRUPT HEAP
//let this function serializable
portMUX_TYPE BLEDevice::mux = portMUX_INITIALIZER_UNLOCKED;
void BLEDevice::removePeerDevice(uint16_t conn_id, bool _client) {
  portENTER_CRITICAL(&mux);
  log_i("remove: %d, GATT role %s", conn_id, _client ? "client" : "server");
  if (m_connectedClientsMap.find(conn_id) != m_connectedClientsMap.end()) {
    m_connectedClientsMap.erase(conn_id);
  }
  portEXIT_CRITICAL(&mux);
}

/* multi connect support */

/**
 * @brief de-Initialize the %BLE environment.
 * @param release_memory release the internal BT stack memory (prevents reinitialization)
 */
void BLEDevice::deinit(bool release_memory) {
  if (!initialized) {
    return;
  }

  // Stop advertising and scanning first
  if (m_bleAdvertising != nullptr) {
    m_bleAdvertising->stop();
  }

  if (m_pScan != nullptr) {
    m_pScan->stop();
  }

  // Delete all BLE objects
  if (m_bleAdvertising != nullptr) {
    delete m_bleAdvertising;
    m_bleAdvertising = nullptr;
  }

  if (m_pScan != nullptr) {
    delete m_pScan;
    m_pScan = nullptr;
  }

  if (m_pServer != nullptr) {
    delete m_pServer;
    m_pServer = nullptr;
  }

  if (m_pClient != nullptr) {
    delete m_pClient;
    m_pClient = nullptr;
  }

  // Clear the connected clients map
  m_connectedClientsMap.clear();

  // Always deinit the BLE stack
#ifdef CONFIG_BLUEDROID_ENABLED
  esp_bluedroid_disable();
  esp_bluedroid_deinit();
#endif

#if defined(CONFIG_NIMBLE_ENABLED)
  nimble_port_stop();
  nimble_port_deinit();
#endif

#if defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
  hostedDeinitBLE();
#endif

#if CONFIG_BT_CONTROLLER_ENABLED
  esp_bt_controller_disable();
  esp_bt_controller_deinit();
#endif

  // Only release memory if requested (this prevents reinitialization)
  if (release_memory) {
#ifdef ARDUINO_ARCH_ESP32
    // Require tests because we released classic BT memory and this can cause crash (most likely not, esp-idf takes care of it)
#if CONFIG_BT_CONTROLLER_ENABLED
    esp_bt_controller_mem_release(ESP_BT_MODE_BTDM);
#endif
#endif
  }

#ifdef CONFIG_NIMBLE_ENABLED
  m_synced = false;
#endif
  initialized = false;
}

void BLEDevice::setCustomGapHandler(gap_event_handler handler) {
  m_customGapHandler = handler;
#ifdef CONFIG_NIMBLE_ENABLED
  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return;
  }
  int rc = ble_gap_event_listener_register(&m_listener, handler, NULL);
  if (rc == BLE_HS_EALREADY) {
    log_i("Already listening to GAP events.");
  } else if (rc != 0) {
    log_e("ble_gap_event_listener_register: rc=%d %s", rc, GeneralUtils::errorToString(rc));
  }
#endif
}

BLEStack BLEDevice::getBLEStack() {
#if defined(CONFIG_BLUEDROID_ENABLED)
  return BLEStack::BLUEDROID;
#elif defined(CONFIG_NIMBLE_ENABLED)
  return BLEStack::NIMBLE;
#else
  return BLEStack::UNKNOWN;
#endif
}

String BLEDevice::getBLEStackString() {
  switch (getBLEStack()) {
    case BLEStack::BLUEDROID: return "Bluedroid";
    case BLEStack::NIMBLE:    return "NimBLE";
    case BLEStack::UNKNOWN:
    default:                  return "Unknown";
  }
}

bool BLEDevice::isHostedBLE() {
#if defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
  return true;
#else
  return false;
#endif
}

/***************************************************************************
 *                           Bluedroid functions                           *
 ***************************************************************************/

#if defined(CONFIG_BLUEDROID_ENABLED)

/**
 * @brief Handle GATT server events.
 *
 * @param [in] event The event that has been newly received.
 * @param [in] gatts_if The connection to the GATT interface.
 * @param [in] param Parameters for the event.
 */
void BLEDevice::gattServerEventHandler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param) {
  log_d("gattServerEventHandler [esp_gatt_if: %d] ... %s", gatts_if, BLEUtils::gattServerEventTypeToString(event).c_str());

