espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
      // Restore CCCD values for bonded device reconnection
      // Per GATT spec, CCCD values should persist for bonded devices
      // Windows and other hosts don't re-write CCCD after reconnection
      if (param->ble_security.auth_cmpl.success && m_pServer != nullptr) {
        BLEAddress peerAddress(param->ble_security.auth_cmpl.bd_addr);
        m_pServer->restoreCCCDValues(peerAddress);
      }

      // Signal completion last - this unblocks any GATT operations waiting for pairing
      BLESecurity::signalAuthenticationComplete();
#endif  // CONFIG_BLE_SMP_ENABLE
    } break;
    case ESP_GAP_BLE_UPDATE_CONN_PARAMS_EVT:
    {
      log_i(
        "ESP_GAP_BLE_UPDATE_CONN_PARAMS_EVT: status=%d, conn_int=%d, latency=%d, timeout=%d", param->update_conn_params.status,
        param->update_conn_params.conn_int, param->update_conn_params.latency, param->update_conn_params.timeout
      );
      break;
    }
    default:
    {
      break;
    }
  }  // switch

  if (BLEDevice::m_pServer != nullptr) {
    BLEDevice::m_pServer->handleGAPEvent(event, param);
  }

  if (BLEDevice::m_pClient != nullptr) {
    BLEDevice::m_pClient->handleGAPEvent(event, param);
  }

  if (BLEDevice::m_pScan != nullptr) {
    BLEDevice::getScan()->handleGAPEvent(event, param);
  }

  if (m_bleAdvertising != nullptr) {
    BLEDevice::getAdvertising()->handleGAPEvent(event, param);
  }

  if (m_customGapHandler != nullptr) {
    BLEDevice::m_customGapHandler(event, param);
  }

}  // gapEventHandler
void BLEDevice::setCustomGattcHandler(gattc_event_handler handler) {
  m_customGattcHandler = handler;
}

void BLEDevice::setCustomGattsHandler(gatts_event_handler handler) {
  m_customGattsHandler = handler;
}

#endif

/***************************************************************************
 *                            NimBLE functions                             *
 ***************************************************************************/

#if defined(CONFIG_NIMBLE_ENABLED)

/**
 * @brief Set the SDIO pins for connection to external ESP MCU when using ESP-Hosted with NimBLE
 * @param [in] clk The clock pin
 * @param [in] cmd The command pin
 * @param [in] d0 The data pin 0
 * @param [in] d1 The data pin 1
 * @param [in] d2 The data pin 2
 * @param [in] d3 The data pin 3
 * @param [in] rst The reset pin
 * @return True if the pins were set successfully.
 */
#if CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE
bool BLEDevice::setPins(int8_t clk, int8_t cmd, int8_t d0, int8_t d1, int8_t d2, int8_t d3, int8_t rst) {
  return hostedSetPins(clk, cmd, d0, d1, d2, d3, rst);
}
#endif

/**
 * @brief Checks if a peer device is whitelisted.
 * @param [in] address The address to check for in the whitelist.
 * @returns True if the address is in the whitelist.
 */
bool BLEDevice::onWhiteList(BLEAddress &address) {
  for (auto &addr : m_whiteList) {
    if (addr == address) {
      return true;
    }
  }
  return false;
}

void BLEDevice::host_task(void *param) {
  log_i("NimBLE host task started");
  nimble_port_run();  // This function will return only when nimble_port_stop() is executed
  nimble_port_freertos_deinit();
}

void BLEDevice::onReset(int reason) {
  if (!m_synced) {
    return;
  }

  m_synced = false;

  log_i("onReset, reason=%d, %s", reason, BLEUtils::returnCodeToString(reason));

  if (initialized) {
    if (m_pScan != nullptr) {
      m_pScan->onHostReset();
    }
  }
}

void BLEDevice::onSync() {
  log_d("onSync");

  if (m_synced) {
    log_d("onSync: already synced");
    return;
  }

  // Set device name first, before any other GAP operations
  if (m_deviceName.length() > 0) {
    int nameRc = ble_svc_gap_device_name_set(m_deviceName.c_str());
    if (nameRc != 0) {
      log_e("ble_svc_gap_device_name_set: rc=%d %s", nameRc, BLEUtils::returnCodeToString(nameRc));
    }
  }

  int rc = ble_hs_util_ensure_addr(0);
  if (rc == 0) {
    rc = ble_hs_util_ensure_addr(1);
  }

  if (rc != 0) {
    log_e("onSync: failed to ensure BLE address. rc=%d", rc);
    return;
  }

  rc = ble_hs_id_copy_addr(BLE_OWN_ADDR_PUBLIC, NULL, NULL);
  if (rc != 0) {
    log_d("onSync: no public address available");
    m_ownAddrType = BLE_OWN_ADDR_RANDOM;
  }

  // Yield for housekeeping tasks before returning to operations.
  // Occasionally triggers exception without.
  ble_npl_time_delay(1);

  m_synced = true;

  if (initialized) {
    if (m_pScan != nullptr) {
      m_pScan->onHostSync();
    }
    if (m_bleAdvertising != nullptr) {
      m_bleAdvertising->onHostSync();
    }
  }
}

void BLEDevice::setDeviceCallbacks(BLEDeviceCallbacks *cb) {
  if (cb == nullptr) {
    m_pDeviceCallbacks = &defaultDeviceCallbacks;
  } else {
    m_pDeviceCallbacks = cb;
  }
}

/**
 * @brief Get the device name.
 * @return The device name.
 */
String BLEDevice::getDeviceName() {
  return m_deviceName;
}

/**
 * @brief Sets the address type to use.
 * @param [in] type Bluetooth Device address type.
 * The available types are defined as:
 * * 0x00: BLE_OWN_ADDR_PUBLIC - Public address; Uses the hardware static address.
 * * 0x01: BLE_OWN_ADDR_RANDOM - Random static address; Uses the hardware or generated random static address.
 * * 0x02: BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT - Resolvable private address, defaults to public if no RPA available.
 * * 0x03: BLE_OWN_ADDR_RPA_RANDOM_DEFAULT - Resolvable private address, defaults to random static if no RPA available.
 */
bool BLEDevice::setOwnAddrType(uint8_t type) {
  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return false;
  }
  int rc = ble_hs_id_copy_addr(type & 1, NULL, NULL);  // Odd values are random
  if (rc != 0) {
    log_e("Unable to set address type %d, rc=%d", type, rc);
    return false;
  }

  m_ownAddrType = type;

  if (type == BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT || type == BLE_OWN_ADDR_RPA_RANDOM_DEFAULT) {
#ifdef CONFIG_IDF_TARGET_ESP32
    // esp32 controller does not support RPA so we must use the random static for calls to the stack
    // the host will take care of the random private address generation/setting.
    m_ownAddrType = BLE_OWN_ADDR_RANDOM;
    rc = ble_hs_pvcy_rpa_config(NIMBLE_HOST_ENABLE_RPA);
#endif
  } else {
#ifdef CONFIG_IDF_TARGET_ESP32
    rc = ble_hs_pvcy_rpa_config(NIMBLE_HOST_DISABLE_PRIVACY);
#endif
  }
  return rc == 0;
}  // setOwnAddrType

/**
 * @brief Set the device address to use.
 * @param [in] addr The address to set.
 * @return True if the address was set successfully.
 * @details To use the address generated the address type must be set to random with `setOwnAddrType`.
 */
bool BLEDevice::setOwnAddr(BLEAddress &addr) {
  return setOwnAddr(addr.getNative());
}  // setOwnAddr

/**
 * @brief Set the device address to use.
 * @param [in] addr The address to set.
 * @return True if the address was set successfully.
 * @details To use the address generated the address type must be set to random with `setOwnAddrType`.
 */
bool BLEDevice::setOwnAddr(uint8_t *addr) {
  if (!initialized) {
    log_e("BLE is not initialized. Call BLEDevice::init() first");
    return false;
  }
  int rc = ble_hs_id_set_rnd(addr);
  if (rc != 0) {
    log_e("Failed to set address, rc=%d", rc);
    return false;
  }
  return true;
}  // setOwnAddr

int BLEDeviceCallbacks::onStoreStatus(struct ble_store_status_event *event, void *arg) {
  log_d("onStoreStatus: default");
  return ble_store_util_status_rr(event, arg);
}

#endif

#endif /* CONFIG_BLUEDROID_ENABLED || CONFIG_NIMBLE_ENABLED */
#endif /* SOC_BLE_SUPPORTED || CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE */
